{"keras_version": "1.1.0", "config": [{"config": {"input_dtype": "float32", "mode": 0, "batch_input_shape": [null, 64, 64, 3], "axis": -1, "beta_regularizer": null, "gamma_regularizer": null, "name": "batchnormalization_1", "epsilon": 1e-05, "trainable": true, "momentum": 0.99}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "bias": true, "activity_regularizer": null, "border_mode": "valid", "dim_ordering": "tf", "nb_col": 3, "nb_filter": 24, "b_constraint": null, "nb_row": 3, "W_regularizer": null, "init": "glorot_uniform", "activation": "linear", "subsample": [1, 1], "b_regularizer": null, "name": "convolution2d_1", "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "elu_1", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"border_mode": "valid", "strides": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_1", "pool_size": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "batchnormalization_2", "mode": 0, "trainable": true, "beta_regularizer": null, "gamma_regularizer": null, "axis": -1, "epsilon": 1e-05, "momentum": 0.99}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "bias": true, "activity_regularizer": null, "border_mode": "valid", "dim_ordering": "tf", "nb_col": 3, "nb_filter": 32, "b_constraint": null, "nb_row": 3, "W_regularizer": null, "init": "glorot_uniform", "activation": "linear", "subsample": [1, 1], "b_regularizer": null, "name": "convolution2d_2", "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "elu_2", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"border_mode": "valid", "strides": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_2", "pool_size": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "batchnormalization_3", "mode": 0, "trainable": true, "beta_regularizer": null, "gamma_regularizer": null, "axis": -1, "epsilon": 1e-05, "momentum": 0.99}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "bias": true, "activity_regularizer": null, "border_mode": "valid", "dim_ordering": "tf", "nb_col": 3, "nb_filter": 64, "b_constraint": null, "nb_row": 3, "W_regularizer": null, "init": "glorot_uniform", "activation": "linear", "subsample": [1, 1], "b_regularizer": null, "name": "convolution2d_3", "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "elu_3", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"border_mode": "valid", "strides": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_3", "pool_size": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "batchnormalization_4", "mode": 0, "trainable": true, "beta_regularizer": null, "gamma_regularizer": null, "axis": -1, "epsilon": 1e-05, "momentum": 0.99}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "bias": true, "activity_regularizer": null, "border_mode": "valid", "dim_ordering": "tf", "nb_col": 3, "nb_filter": 64, "b_constraint": null, "nb_row": 3, "W_regularizer": null, "init": "glorot_uniform", "activation": "linear", "subsample": [1, 1], "b_regularizer": null, "name": "convolution2d_4", "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "elu_4", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"border_mode": "valid", "strides": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_4", "pool_size": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "batchnormalization_5", "mode": 0, "trainable": true, "beta_regularizer": null, "gamma_regularizer": null, "axis": -1, "epsilon": 1e-05, "momentum": 0.99}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.2}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"input_dim": null, "bias": true, "activity_regularizer": null, "b_constraint": null, "trainable": true, "W_constraint": null, "W_regularizer": null, "activation": "linear", "init": "glorot_uniform", "b_regularizer": null, "name": "dense_1", "output_dim": 512}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "elu_5", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.5}, "class_name": "Dropout"}, {"config": {"input_dim": null, "bias": true, "activity_regularizer": null, "b_constraint": null, "trainable": true, "W_constraint": null, "W_regularizer": null, "activation": "tanh", "init": "glorot_uniform", "b_regularizer": null, "name": "dense_2", "output_dim": 1}, "class_name": "Dense"}], "class_name": "Sequential"}